{
  "backend/main.mo": "Backend canister implementing access‑controlled user profiles, video uploads, watermark updates, and blob storage using mixins and a secret‑based gate.",
  "backend/migration.mo": "Provides a no‑op migration that maps old actor state to the new structure without modification.",
  "feature_evidence.json": "Feature evidence report mapping features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all frontend components, hooks, styles, and extension files.",
  "frontend/.env.example": "Example env file explaining frontend access‑secret configuration and how URL hash secrets are validated.",
  "frontend/extension/background.js": "Chrome extension service worker that opens the deployed app URL containing the access secret.",
  "frontend/extension/manifest.json": "Manifest V3 definition for the Chrome extension with metadata, icons, and background worker.",
  "frontend/extension/README.md": "Guide for configuring, testing, packaging, and publishing the Chrome extension that opens the app.",
  "frontend/index.css": "Tailwind base and CSS variable theme definitions for light and dark modes with warm color palette.",
  "frontend/index.html": "HTML entrypoint loading the root React app and mounting main.tsx.",
  "frontend/src/App.tsx": "Top-level app managing workflow steps for uploading, marking, processing, and downloading videos, including access checks and state transitions.",
  "frontend/src/components/AppLayout.tsx": "Provides the main page layout with a footer and wraps child content in a full-screen container.",
  "frontend/src/components/DownloadPanel.tsx": "Displays the processed video preview and offers actions to download the video or start a new workflow.",
  "frontend/src/components/LockedScreen.tsx": "Shows an access-restricted message when a user lacks a valid access link.",
  "frontend/src/components/MyUploadsSection.tsx": "Lists the user's uploaded videos with status badges and options to continue or delete each upload.",
  "frontend/src/components/ProcessingScreen.tsx": "Handles watermark marking, simulates processing progress, and displays status updates until completion or failure.",
  "frontend/src/components/ShareAccessLink.tsx": "Generates and allows copying a shareable access URL derived from the user's access secret.",
  "frontend/src/components/UploadProgressCard.tsx": "Manages chunked video uploads, showing progress, handling retries or cancellation, and signaling completion.",
  "frontend/src/components/VideoFilePicker.tsx": "React component for selecting and previewing a video file, handling validation and triggering upload. Integrates actor readiness state to enable or disable upload.",
  "frontend/src/components/VideoWatermarkSelector.tsx": "Allows users to define and adjust a draggable/resizable watermark region over a video. Computes scale, handles mouse interactions, and initializes a default region on metadata load.",
  "frontend/src/components/WatermarkToolsPanel.tsx": "Provides numeric controls for editing the watermark region and actions for navigating, resetting, and confirming processing. Updates region fields and triggers callbacks.",
  "frontend/src/components/WorkflowHeader.tsx": "Renders a multi-step workflow header with icons, progress indicators, and an informational alert. Displays the app logo and step highlighting based on the current stage.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, with automatic refresh on identity changes. Initializes access control and invalidates dependent queries when updated.",
  "frontend/src/hooks/useChunkedVideoUpload.ts": "Provides simulated chunked upload logic with progress tracking, cancellation, retry, and error handling. Uses backend mutation to create video metadata before chunk simulation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook, managing auth client creation, login state, and stored identities. Exposes identity, login, logout, and status helpers to consumers.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching, mutating, and updating video data with unlisted-access checks and backend actor calls.",
  "frontend/src/hooks/useUnlistedAccess.ts": "Manages unlisted secret access via sessionStorage or URL hash and exposes lock state and helpers.",
  "frontend/src/hooks/useVideoStatus.ts": "Combines video data with watermark and status mutation hooks to provide status text, actions, and error handling.",
  "frontend/src/index.css": "Tailwind base styles plus custom OKLCH color variables, theme tokens, and utilities for video selection UI.",
  "frontend/src/main.tsx": "App entrypoint setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters and session-based state.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, typography, animations, and enabling plugins.",
  "project_state.json": "Project metadata defining features, requirements, and state for an unlisted-access video app and Chrome extension."
}